PIM_III/02_Modelagem_UML_Astah/UC03_Realizar_Teste_Nivelamento/README.md
```mermaid
sequenceDiagram
    autonumber
    participant A as :Aluno
    participant S as :Simulado
    A->>S: iniciarTeste()
    activate S
    S-->>A: listaQuestoes[]
    A->>S: enviarRespostas()
    S-->>A: notaFinal
    deactivate S
    A->>A: definirFaseInicial(nota)
```
